#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/unisorter/fileshare-infra/runs/run-MWe2sCLcGH1dkEVM

Waiting for the plan to start...

Terraform v1.0.1
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.lambda_presign_upload_url.module.lambda_function.null_resource.archive[0]: Refreshing state... [id=2950409025440839362]
module.lambda_presign_upload_url.module.lambda_function.local_file.archive_plan[0]: Refreshing state... [id=60d2920dab264ccd63c879669ae663948cd9f5b5]
module.api_presign_upload_url.random_pet.this: Refreshing state... [id=factual-coral]
module.api_presign_upload_url.module.api_gateway.aws_apigatewayv2_route.this["GET /api/file-share/upload"]: Refreshing state... [id=x1yi9ne]
module.api_presign_upload_url.module.api_gateway.aws_apigatewayv2_api.this[0]: Refreshing state... [id=0i0v9581d3]
module.lambda_presign_upload_url.module.lambda_function.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/s3-pre-sign-upload-url]
module.lambda_presign_upload_url.module.lambda_function.aws_iam_role.lambda[0]: Refreshing state... [id=s3-pre-sign-upload-url]
module.api_presign_upload_url.module.api_gateway.aws_apigatewayv2_integration.this["GET /api/file-share/upload"]: Refreshing state... [id=1vx2bvc]
module.lambda_presign_upload_url.module.lambda_function.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::797849036607:policy/s3-pre-sign-upload-url-logs]
module.api_presign_upload_url.module.api_gateway.aws_apigatewayv2_stage.default[0]: Refreshing state... [id=$default]
module.api_presign_upload_url.module.api_gateway.aws_apigatewayv2_integration.this["$default"]: Refreshing state... [id=fqsycqm]
module.lambda_presign_upload_url.module.lambda_function.aws_iam_policy_attachment.logs[0]: Refreshing state... [id=s3-pre-sign-upload-url-logs]
module.s3.aws_kms_key.objects: Refreshing state... [id=ad883df7-395c-47c0-b3c0-62c35508cf96]
module.lambda_presign_upload_url.module.lambda_function.aws_lambda_function.this[0]: Refreshing state... [id=s3-pre-sign-upload-url]
module.api_presign_upload_url.module.api_gateway.aws_apigatewayv2_route.this["$default"]: Refreshing state... [id=pziv8no]
module.api_presign_upload_url.aws_cloudwatch_log_group.logs: Refreshing state... [id=factual-coral]
module.s3.module.log_bucket.aws_s3_bucket.this[0]: Refreshing state... [id=unisorter-file-share-logs]
module.s3.module.log_bucket.aws_s3_bucket_policy.this[0]: Refreshing state... [id=unisorter-file-share-logs]
module.s3.module.log_bucket.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=unisorter-file-share-logs]
module.s3.module.s3_bucket.aws_s3_bucket.this[0]: Refreshing state... [id=unisorter-file-share]
module.s3.module.s3_bucket.aws_s3_bucket_policy.this[0]: Refreshing state... [id=unisorter-file-share]
module.s3.module.s3_bucket.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=unisorter-file-share]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.api_presign_upload_url.aws_cloudwatch_log_group.logs has been deleted
  - resource "aws_cloudwatch_log_group" "logs" {
      - arn               = "arn:aws:logs:ap-southeast-2:797849036607:log-group:factual-coral" -> null
      - id                = "factual-coral" -> null
      - name              = "factual-coral" -> null
      - retention_in_days = 0 -> null
      - tags_all          = {} -> null
    }
  # module.api_presign_upload_url.module.api_gateway.aws_apigatewayv2_integration.this["$default"] has been deleted
  - resource "aws_apigatewayv2_integration" "this" {
      - api_id                 = "0i0v9581d3" -> null
      - connection_type        = "INTERNET" -> null
      - id                     = "fqsycqm" -> null
      - integration_method     = "POST" -> null
      - integration_type       = "AWS_PROXY" -> null
      - integration_uri        = "arn:aws:lambda:ap-southeast-2:797849036607:function:s3-pre-sign-upload-url" -> null
      - payload_format_version = "1.0" -> null
      - timeout_milliseconds   = 30000 -> null
    }
  # module.api_presign_upload_url.module.api_gateway.aws_apigatewayv2_integration.this["GET /api/file-share/upload"] has been deleted
  - resource "aws_apigatewayv2_integration" "this" {
      - api_id                 = "0i0v9581d3" -> null
      - connection_type        = "INTERNET" -> null
      - id                     = "1vx2bvc" -> null
      - integration_method     = "POST" -> null
      - integration_type       = "AWS_PROXY" -> null
      - integration_uri        = "arn:aws:lambda:ap-southeast-2:797849036607:function:s3-pre-sign-upload-url" -> null
      - payload_format_version = "2.0" -> null
      - request_parameters     = {} -> null
      - request_templates      = {} -> null
      - timeout_milliseconds   = 30000 -> null
    }
  # module.api_presign_upload_url.module.api_gateway.aws_apigatewayv2_route.this["$default"] has been deleted
  - resource "aws_apigatewayv2_route" "this" {
      - api_id             = "0i0v9581d3" -> null
      - api_key_required   = false -> null
      - authorization_type = "NONE" -> null
      - id                 = "pziv8no" -> null
      - route_key          = "$default" -> null
      - target             = "integrations/fqsycqm" -> null
    }
  # module.api_presign_upload_url.module.api_gateway.aws_apigatewayv2_route.this["GET /api/file-share/upload"] has been deleted
  - resource "aws_apigatewayv2_route" "this" {
      - api_id               = "0i0v9581d3" -> null
      - api_key_required     = false -> null
      - authorization_scopes = [] -> null
      - authorization_type   = "NONE" -> null
      - id                   = "x1yi9ne" -> null
      - request_models       = {} -> null
      - route_key            = "GET /api/file-share/upload" -> null
      - target               = "integrations/1vx2bvc" -> null
    }
  # module.api_presign_upload_url.module.api_gateway.aws_apigatewayv2_stage.default[0] has been deleted
  - resource "aws_apigatewayv2_stage" "default" {
      - api_id          = "0i0v9581d3" -> null
      - arn             = "arn:aws:apigateway:ap-southeast-2::/apis/0i0v9581d3/stages/$default" -> null
      - auto_deploy     = true -> null
      - deployment_id   = "45q0rm" -> null
      - execution_arn   = "arn:aws:execute-api:ap-southeast-2:797849036607:0i0v9581d3/$default" -> null
      - id              = "$default" -> null
      - invoke_url      = "https://0i0v9581d3.execute-api.ap-southeast-2.amazonaws.com/" -> null
      - name            = "$default" -> null
      - stage_variables = {} -> null
      - tags            = {
          - "Name" = "dev-api-new"
        } -> null
      - tags_all        = {
          - "Name" = "dev-api-new"
        } -> null

      - access_log_settings {
          - destination_arn = "arn:aws:logs:ap-southeast-2:797849036607:log-group:factual-coral" -> null
          - format          = "$context.identity.sourceIp - - [$context.requestTime] \"$context.httpMethod $context.routeKey $context.protocol\" $context.status $context.responseLength $context.requestId $context.integrationErrorMessage" -> null
        }

      - default_route_settings {
          - data_trace_enabled       = false -> null
          - detailed_metrics_enabled = false -> null
          - throttling_burst_limit   = 0 -> null
          - throttling_rate_limit    = 0 -> null
        }
    }
  # module.api_presign_upload_url.module.api_gateway.aws_apigatewayv2_api.this[0] has been deleted
  - resource "aws_apigatewayv2_api" "this" {
      - api_endpoint                 = "https://0i0v9581d3.execute-api.ap-southeast-2.amazonaws.com" -> null
      - api_key_selection_expression = "$request.header.x-api-key" -> null
      - arn                          = "arn:aws:apigateway:ap-southeast-2::/apis/0i0v9581d3" -> null
      - description                  = "My awesome HTTP API Gateway" -> null
      - disable_execute_api_endpoint = false -> null
      - execution_arn                = "arn:aws:execute-api:ap-southeast-2:797849036607:0i0v9581d3" -> null
      - id                           = "0i0v9581d3" -> null
      - name                         = "factual-coral-http" -> null
      - protocol_type                = "HTTP" -> null
      - route_selection_expression   = "$request.method $request.path" -> null
      - tags                         = {
          - "Name" = "dev-api-new"
        } -> null
      - tags_all                     = {
          - "Name" = "dev-api-new"
        } -> null

      - cors_configuration {
          - allow_credentials = false -> null
          - allow_headers     = [
              - "authorization",
              - "content-type",
              - "x-amz-date",
              - "x-amz-security-token",
              - "x-amz-user-agent",
              - "x-api-key",
            ] -> null
          - allow_methods     = [
              - "*",
            ] -> null
          - allow_origins     = [
              - "*",
            ] -> null
          - expose_headers    = [] -> null
          - max_age           = 0 -> null
        }
    }
  # module.lambda_presign_upload_url.module.lambda_function.aws_cloudwatch_log_group.lambda[0] has been deleted
  - resource "aws_cloudwatch_log_group" "lambda" {
      - arn               = "arn:aws:logs:ap-southeast-2:797849036607:log-group:/aws/lambda/s3-pre-sign-upload-url" -> null
      - id                = "/aws/lambda/s3-pre-sign-upload-url" -> null
      - name              = "/aws/lambda/s3-pre-sign-upload-url" -> null
      - retention_in_days = 0 -> null
      - tags              = {
          - "Name" = "s3-pre-sign-upload-url"
        } -> null
      - tags_all          = {
          - "Name" = "s3-pre-sign-upload-url"
        } -> null
    }
  # module.lambda_presign_upload_url.module.lambda_function.aws_lambda_function.this[0] has been deleted
  - resource "aws_lambda_function" "this" {
      - arn                            = "arn:aws:lambda:ap-southeast-2:797849036607:function:s3-pre-sign-upload-url" -> null
      - description                    = "Lambda function to create presign url for uploading object to s3 bucket" -> null
      - filename                       = "builds/31c947678d2beede935a54ed98252ea3b79f7e4b957c36a5668af8a197e1f4c2.zip" -> null
      - function_name                  = "s3-pre-sign-upload-url" -> null
      - handler                        = "index.lambda_handler" -> null
      - id                             = "s3-pre-sign-upload-url" -> null
      - invoke_arn                     = "arn:aws:apigateway:ap-southeast-2:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-2:797849036607:function:s3-pre-sign-upload-url/invocations" -> null
      - last_modified                  = "2021-06-28T01:11:15.327+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:ap-southeast-2:797849036607:function:s3-pre-sign-upload-url:$LATEST" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::797849036607:role/s3-pre-sign-upload-url" -> null
      - runtime                        = "python3.8" -> null
      - source_code_hash               = "zZqSmIraG7ZUCLQJyunNLi81HJ+i8WdGpvuwjhs6BMc=" -> null
      - source_code_size               = 586 -> null
      - tags                           = {
          - "Name" = "s3-pre-sign-upload-url"
        } -> null
      - tags_all                       = {
          - "Name" = "s3-pre-sign-upload-url"
        } -> null
      - timeout                        = 3 -> null
      - version                        = "$LATEST" -> null

      - environment {
          - variables = {
              - "S3_BUCKET" = "unisorter-file-share"
            } -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }
  # module.lambda_presign_upload_url.module.lambda_function.local_file.archive_plan[0] has been deleted
  - resource "local_file" "archive_plan" {
      - content              = jsonencode(
            {
              - artifacts_dir = "builds"
              - build_plan    = [
                  - [
                      - "zip",
                      - "lambda/pre-signed-url",
                      - null,
                    ],
                ]
              - filename      = "builds/31c947678d2beede935a54ed98252ea3b79f7e4b957c36a5668af8a197e1f4c2.zip"
              - runtime       = "python3.8"
            }
        ) -> null
      - directory_permission = "0755" -> null
      - file_permission      = "0644" -> null
      - filename             = "builds/31c947678d2beede935a54ed98252ea3b79f7e4b957c36a5668af8a197e1f4c2.plan.json" -> null
      - id                   = "60d2920dab264ccd63c879669ae663948cd9f5b5" -> null
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.api_presign_upload_url.random_pet.this will be destroyed
  - resource "random_pet" "this" {
      - id        = "factual-coral" -> null
      - length    = 2 -> null
      - separator = "-" -> null
    }

  # module.api_presigned_upload_url.aws_cloudwatch_log_group.logs will be created
  + resource "aws_cloudwatch_log_group" "logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "generate-presigned-upload-url-http-api-logs"
      + retention_in_days = 0
      + tags              = {
          + "Stack" = "Unisorter"
        }
      + tags_all          = {
          + "Stack" = "Unisorter"
        }
    }

  # module.s3.aws_kms_key.objects will be destroyed
  - resource "aws_kms_key" "objects" {
      - arn                      = "arn:aws:kms:ap-southeast-2:797849036607:key/ad883df7-395c-47c0-b3c0-62c35508cf96" -> null
      - customer_master_key_spec = "SYMMETRIC_DEFAULT" -> null
      - deletion_window_in_days  = 30 -> null
      - description              = "KMS key is used to encrypt bucket objects" -> null
      - enable_key_rotation      = true -> null
      - id                       = "ad883df7-395c-47c0-b3c0-62c35508cf96" -> null
      - is_enabled               = true -> null
      - key_id                   = "ad883df7-395c-47c0-b3c0-62c35508cf96" -> null
      - key_usage                = "ENCRYPT_DECRYPT" -> null
      - policy                   = jsonencode(
            {
              - Id        = "key-default-1"
              - Statement = [
                  - {
                      - Action    = "kms:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::797849036607:root"
                        }
                      - Resource  = "*"
                      - Sid       = "Enable IAM User Permissions"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - tags                     = {} -> null
      - tags_all                 = {} -> null
    }

  # module.api_presigned_upload_url.module.api_gateway.aws_apigatewayv2_api.this[0] will be created
  + resource "aws_apigatewayv2_api" "this" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + description                  = "API Gatway_2 API to generate presigned URL for upload object to S3 bucket"
      + disable_execute_api_endpoint = false
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + name                         = "generate-presigned-upload-url-http-api"
      + protocol_type                = "HTTP"
      + route_selection_expression   = "$request.method $request.path"
      + tags                         = {
          + "Stack" = "Unisorter"
        }
      + tags_all                     = {
          + "Stack" = "Unisorter"
        }

      + cors_configuration {
          + allow_headers = [
              + "authorization",
              + "content-type",
              + "x-amz-date",
              + "x-amz-security-token",
              + "x-amz-user-agent",
              + "x-api-key",
            ]
          + allow_methods = [
              + "*",
            ]
          + allow_origins = [
              + "*",
            ]
        }
    }

  # module.api_presigned_upload_url.module.api_gateway.aws_apigatewayv2_integration.this["GET /api/file-share/upload"] will be created
  + resource "aws_apigatewayv2_integration" "this" {
      + api_id                                    = (known after apply)
      + connection_id                             = (known after apply)
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = (known after apply)
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "2.0"
      + timeout_milliseconds                      = 3000
    }

  # module.api_presigned_upload_url.module.api_gateway.aws_apigatewayv2_route.this["GET /api/file-share/upload"] will be created
  + resource "aws_apigatewayv2_route" "this" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "GET /api/file-share/upload"
      + target             = (known after apply)
    }

  # module.api_presigned_upload_url.module.api_gateway.aws_apigatewayv2_stage.default[0] will be created
  + resource "aws_apigatewayv2_stage" "default" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "$default"
      + tags          = {
          + "Stack" = "Unisorter"
        }
      + tags_all      = {
          + "Stack" = "Unisorter"
        }

      + access_log_settings {
          + destination_arn = (known after apply)
          + format          = (known after apply)
        }

      + default_route_settings {
          + data_trace_enabled       = false
          + detailed_metrics_enabled = false
          + logging_level            = (known after apply)
          + throttling_burst_limit   = 100
          + throttling_rate_limit    = 100
        }
    }

  # module.lambda_presign_upload_url.module.lambda_function.aws_iam_policy.logs[0] will be destroyed
  - resource "aws_iam_policy" "logs" {
      - arn       = "arn:aws:iam::797849036607:policy/s3-pre-sign-upload-url-logs" -> null
      - id        = "arn:aws:iam::797849036607:policy/s3-pre-sign-upload-url-logs" -> null
      - name      = "s3-pre-sign-upload-url-logs" -> null
      - path      = "/" -> null
      - policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ap-southeast-2:797849036607:log-group:/aws/lambda/s3-pre-sign-upload-url:*:*",
                          - "arn:aws:logs:ap-southeast-2:797849036607:log-group:/aws/lambda/s3-pre-sign-upload-url:*",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id = "ANPA3TQ4CE47SJAGKLO56" -> null
      - tags      = {
          - "Name" = "s3-pre-sign-upload-url"
        } -> null
      - tags_all  = {
          - "Name" = "s3-pre-sign-upload-url"
        } -> null
    }

  # module.lambda_presign_upload_url.module.lambda_function.aws_iam_policy_attachment.logs[0] will be destroyed
  - resource "aws_iam_policy_attachment" "logs" {
      - groups     = [] -> null
      - id         = "s3-pre-sign-upload-url-logs" -> null
      - name       = "s3-pre-sign-upload-url-logs" -> null
      - policy_arn = "arn:aws:iam::797849036607:policy/s3-pre-sign-upload-url-logs" -> null
      - roles      = [
          - "s3-pre-sign-upload-url",
        ] -> null
      - users      = [] -> null
    }

  # module.lambda_presign_upload_url.module.lambda_function.aws_iam_role.lambda[0] will be destroyed
  - resource "aws_iam_role" "lambda" {
      - arn                   = "arn:aws:iam::797849036607:role/s3-pre-sign-upload-url" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2021-06-26T05:40:31Z" -> null
      - force_detach_policies = true -> null
      - id                    = "s3-pre-sign-upload-url" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::797849036607:policy/s3-pre-sign-upload-url-logs",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "s3-pre-sign-upload-url" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "Name" = "s3-pre-sign-upload-url"
        } -> null
      - tags_all              = {
          - "Name" = "s3-pre-sign-upload-url"
        } -> null
      - unique_id             = "AROA3TQ4CE475FS73HHOZ" -> null

      - inline_policy {}
    }

  # module.lambda_presign_upload_url.module.lambda_function.null_resource.archive[0] will be destroyed
  - resource "null_resource" "archive" {
      - id       = "2950409025440839362" -> null
      - triggers = {
          - "filename"  = "builds/31c947678d2beede935a54ed98252ea3b79f7e4b957c36a5668af8a197e1f4c2.zip"
          - "timestamp" = "1624843405937228000"
        } -> null
    }

  # module.s3.module.s3_bucket.data.aws_iam_policy_document.combined[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "combined"  {
      ~ id                      = "2476060572" -> (known after apply)
      ~ json                    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - aws:SecureTransport = [
                                  - "false",
                                ]
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::unisorter-file-share/*",
                          - "arn:aws:s3:::unisorter-file-share",
                        ]
                      - Sid       = "denyInsecureTransport"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ source_policy_documents = [
          - jsonencode(
                {
                  - Statement = [
                      - {
                          - Action    = "s3:*"
                          - Condition = {
                              - Bool = {
                                  - aws:SecureTransport = [
                                      - "false",
                                    ]
                                }
                            }
                          - Effect    = "Deny"
                          - Principal = "*"
                          - Resource  = [
                              - "arn:aws:s3:::unisorter-file-share/*",
                              - "arn:aws:s3:::unisorter-file-share",
                            ]
                          - Sid       = "denyInsecureTransport"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ),
        ] -> (known after apply)
      - version                 = "2012-10-17" -> null
    }

  # module.s3.module.s3_bucket.data.aws_iam_policy_document.deny_insecure_transport[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "deny_insecure_transport"  {
      ~ id      = "2476060572" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - aws:SecureTransport = [
                                  - "false",
                                ]
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::unisorter-file-share/*",
                          - "arn:aws:s3:::unisorter-file-share",
                        ]
                      - Sid       = "denyInsecureTransport"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (4 unchanged attributes hidden)


            # (2 unchanged blocks hidden)
        }
    }

  # module.s3.module.s3_bucket.aws_s3_bucket.this[0] will be updated in-place
  ~ resource "aws_s3_bucket" "this" {
        id                          = "unisorter-file-share"
        tags                        = {}
        # (10 unchanged attributes hidden)



      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - kms_master_key_id = "arn:aws:kms:ap-southeast-2:797849036607:key/ad883df7-395c-47c0-b3c0-62c35508cf96" -> null
                  - sse_algorithm     = "aws:kms" -> null
                }
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.s3.module.s3_bucket.aws_s3_bucket_policy.this[0] will be updated in-place
  ~ resource "aws_s3_bucket_policy" "this" {
        id     = "unisorter-file-share"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - aws:SecureTransport = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::unisorter-file-share/*",
                          - "arn:aws:s3:::unisorter-file-share",
                        ]
                      - Sid       = "denyInsecureTransport"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.api_presigned_upload_url.module.lambda_function.module.lambda_function.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.api_presigned_upload_url.module.lambda_function.module.lambda_function.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/generate-presigned-upload-url"
      + retention_in_days = 0
      + tags              = {
          + "Stack" = "Unisorter"
        }
      + tags_all          = {
          + "Stack" = "Unisorter"
        }
    }

  # module.api_presigned_upload_url.module.lambda_function.module.lambda_function.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "generate-presigned-upload-url-logs"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags      = {
          + "Stack" = "Unisorter"
        }
      + tags_all  = {
          + "Stack" = "Unisorter"
        }
    }

  # module.api_presigned_upload_url.module.lambda_function.module.lambda_function.aws_iam_policy_attachment.logs[0] will be created
  + resource "aws_iam_policy_attachment" "logs" {
      + id         = (known after apply)
      + name       = "generate-presigned-upload-url-logs"
      + policy_arn = (known after apply)
      + roles      = [
          + "generate-presigned-upload-url",
        ]
    }

  # module.api_presigned_upload_url.module.lambda_function.module.lambda_function.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "generate-presigned-upload-url"
      + path                  = "/"
      + tags                  = {
          + "Stack" = "Unisorter"
        }
      + tags_all              = {
          + "Stack" = "Unisorter"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.api_presigned_upload_url.module.lambda_function.module.lambda_function.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + arn                            = (known after apply)
      + description                    = "Lambda function to create presigned url for uploading object to s3 bucket"
      + filename                       = "builds/24d98b059cc66d0941a2e627ac5e860027a32af97f29e45e5db621af9d8b91df.zip"
      + function_name                  = "generate-presigned-upload-url"
      + handler                        = "index.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Stack" = "Unisorter"
        }
      + tags_all                       = {
          + "Stack" = "Unisorter"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "S3_BUCKET" = "unisorter-file-share"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.api_presigned_upload_url.module.lambda_function.module.lambda_function.aws_lambda_permission.current_version_triggers["AllowExecutionFromAPIGateway"] will be created
  + resource "aws_lambda_permission" "current_version_triggers" {
      + action        = "lambda:InvokeFunction"
      + function_name = "generate-presigned-upload-url"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + qualifier     = (known after apply)
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromAPIGateway"
    }

  # module.api_presigned_upload_url.module.lambda_function.module.lambda_function.aws_lambda_permission.unqualified_alias_triggers["AllowExecutionFromAPIGateway"] will be created
  + resource "aws_lambda_permission" "unqualified_alias_triggers" {
      + action        = "lambda:InvokeFunction"
      + function_name = "generate-presigned-upload-url"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromAPIGateway"
    }

  # module.api_presigned_upload_url.module.lambda_function.module.lambda_function.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + "zip",
                      + "api-gateway/http-presigned-upload-url/lambda/pre-signed-upload-url",
                      + null,
                    ],
                ]
              + filename      = "builds/24d98b059cc66d0941a2e627ac5e860027a32af97f29e45e5db621af9d8b91df.zip"
              + runtime       = "python3.8"
            }
        )
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/24d98b059cc66d0941a2e627ac5e860027a32af97f29e45e5db621af9d8b91df.plan.json"
      + id                   = (known after apply)
    }

  # module.api_presigned_upload_url.module.lambda_function.module.lambda_function.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/24d98b059cc66d0941a2e627ac5e860027a32af97f29e45e5db621af9d8b91df.zip"
          + "timestamp" = "1624850262197326800"
        }
    }

Plan: 14 to add, 2 to change, 6 to destroy.


```

</details>

*Pusher: @umangm99, Action: `pull_request`*